InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Misc/ESP_Now_Send_Ver2025_revJan2026/src/main.cpp
  // Clamp hasil ke range valid (double check)
  if (duty < 205) duty = 205;  // Min duty untuk 1000 µs
  if (duty > 410) duty = 410;  // Max duty untuk 2000 µs
  
  return duty;
}

/**
 * @brief Mode Manual - Kontrol rudder langsung dari receiver RC
 * 
 * @details
 * Function ini mengontrol rudder secara langsung berdasarkan input dari channel 1 RC.
 * Range kontrol: -40° hingga +40° dari posisi neutral (90°).
 * 
 * @note
 * - Reset semua flag turning/zigzag ketika masuk mode manual
 * - Zigzag setpoint di-update dari yaw saat ini
 * - Zigzag yaw di-set ke 0 karena tidak ada zigzag di mode manual
 */
void rudder_manual() {
  // ========== Reset State Machine ==========
  // Reset semua flag turning/zigzag ketika masuk mode manual
  g_reset_turning_left = true;
  g_reset_turning_right = true;
  g_reset_zigzag_left = true;
  g_reset_zigzag_right = true;
  state = belok_kanan_1a;  // Reset state ke awal
  
  // ========== Map RC Input ke Servo Offset ==========
  // Map rudder (1000..1992) ke servo_angle_current_offset (-40..40 derajat)
  servo_angle_current_offset = mapFloat(controlInput.rudder, 1000, 1992, -40.0f, 40.0f);
  servo_angle_current_offset = constrain(servo_angle_current_offset, -40.0f, 40.0f);

  // ========== Calculate dan Set Servo Position ==========
  float calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
  servo_duty = angleToDuty(calculated_angle);
  bool write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);

  // ========== Update Zigzag Setpoint ==========
  // Set zigzag setpoint dari yaw saat ini (untuk digunakan saat masuk mode zigzag)
  // dataToSend.yaw dalam uint16_t (× 100), jadi bagi 100 dulu
  zigzag_setpoint = dataToSend.yaw / 100.0;
  // zigzag_yaw = 0 saat manual (tidak ada zigzag)
  dataToSend.zigzag_yaw = (int16_t)(((dataToSend.yaw / 100.0) - zigzag_setpoint ) * 100);
}

void rudder_turning_right() {
  static float current_step = 0.0f;
  static uint8_t iteration_counter = 0;  // Counter untuk menghitung iterasi
  
  // Check if reset was requested
  if (g_reset_turning_left) {
    current_step = 0.0f;
    iteration_counter = 0;  // Reset counter juga
    g_reset_turning_left = false;
  }
  
  // Set offset dengan step saat ini
  servo_angle_current_offset = current_step;
  
  // Increment counter
  iteration_counter++;
  
  // Hanya update step jika counter mencapai interval
  if (iteration_counter >= rudder_step_interval) {
    if (current_step < 35.0f) {
      current_step += 5.0f;
      if (current_step > 35.0f) {
        current_step = 35.0f;
      }
    }
    iteration_counter = 0;  // Reset counter
  }
  
  float calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;

  // Set duty cycle to be write for servo rudder degree move
  servo_duty = angleToDuty(calculated_angle);
  bool write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);

  // Set zigzag setpoint dan hitung zigzag_yaw
  zigzag_setpoint = dataToSend.yaw / 100.0;
  dataToSend.zigzag_yaw = (int16_t)(((dataToSend.yaw / 100.0) - zigzag_setpoint) * 100);  // tidak ada zigzag saat turning
}

void rudder_turning_left() {
  static float current_step = 0.0f;
  static uint8_t iteration_counter = 0;  // Counter untuk menghitung iterasi
  
  // Check if reset was requested
  if (g_reset_turning_right) {
    current_step = 0.0f;
    iteration_counter = 0;  // Reset counter juga
    g_reset_turning_right = false;
  }
  
  // Set offset dengan step saat ini
  servo_angle_current_offset = current_step;
  
  // Increment counter
  iteration_counter++;
  
  // Hanya update step jika counter mencapai interval
  if (iteration_counter >= rudder_step_interval) {
    if (current_step > -35.0f) {
      current_step -= 5.0f;
      if (current_step < -35.0f) {
        current_step = -35.0f;
      }
    }
    iteration_counter = 0;  // Reset counter
  }
  
  float calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
  // Serial.println(calculated_angle);

  // Set duty cycle to be write for servo rudder degree move
  servo_duty = angleToDuty(calculated_angle);
  bool write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);

  // Set zigzag setpoint dan hitung zigzag_yaw
  zigzag_setpoint = dataToSend.yaw / 100.0;
  dataToSend.zigzag_yaw = (int16_t)(((dataToSend.yaw / 100.0) - zigzag_setpoint) * 100);  // tidak ada zigzag saat turning
}

void rudder_zigzag_10() {
 
  // Hitung zigzag_yaw: yaw_current - zigzag_setpoint (dalam derajat float)
  float yaw_float = dataToSend.yaw / 100.0;  // Konversi uint16_t ke float
  float zigzag_yaw_float = yaw_float - zigzag_setpoint;
  dataToSend.zigzag_yaw = (int16_t)(zigzag_yaw_float * 100);  // Konversi ke int16_t (× 100)
  // Serial.print(dataToSend.zigzag_yaw); Serial.print(",");
  // Serial.print(zigzag_setpoint); Serial.print(",");
  float calculated_angle;
  bool write_result;
  static float current_step = 0.0f;
  static uint8_t iteration_counter = 0;  // Counter untuk menghitung iterasi
  // Serial.print(current_step); 
  // Serial.print(",");
  // Serial.print(state);
  // Serial.print(",");

  switch (state)
  {
    
    case belok_kanan_1a: //rudder belok kanan 10 derajat
      if (g_reset_zigzag_right) {
        current_step = 0.0f;
        iteration_counter = 0;  // Reset counter juga
        g_reset_zigzag_right = false;
      }
      
     
      // Increment counter
      iteration_counter++;
      Serial.print(iteration_counter);
      Serial.print(",");
      
      // Hanya update step jika counter mencapai interval
      if (iteration_counter >= rudder_step_interval) {
        if (current_step < 10.0f) {
          current_step += 1.0f;
          if (current_step >= 10.0f) {
            current_step = 10.0f;
          }
        }
        iteration_counter = 0;  // Reset counter
      }
      
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      // Set offset dengan step saat ini
      servo_angle_current_offset = current_step;
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
      // Serial.print(calculated_angle); Serial.print(",");
    
      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
      // Serial.println(servo_duty); 
      //Serial.print(",");  
      
      // HANYA TRANSISI KE STATE BERIKUTNYA JIKA SUDAH MENCAPAI TARGET
      if (current_step >= 10.0f) {
        state = belok_kanan_1b;
      }
    
    break;

    /*************************************************/
    
    case belok_kanan_1b:
      // Serial.println("DEBUG_Zigzag: belok_kanan_1b");
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
      // Serial.print(calculated_angle);
      // Serial.print(",");

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
      // Serial.println(servo_duty);
      
      if (dataToSend.zigzag_yaw <= -1000) //menunggu heading zigzag lebih dari 10 derajat (× 100 = -1000)
      {
      state = belok_kiri_1a;
      g_reset_zigzag_right = true;
      } 
     break;

    /*************************************************/
    
