InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Misc/ESP_Now_Send_Ver2025_revJan2026/src/main.cpp
    case belok_kiri_1a: //rudder belok kiri 10 derajat
    // Serial.print("belok_kiri_1a"); Serial.print(",");

      if (g_reset_zigzag_left) {
        // current_step = 0.0f;
        iteration_counter = 0;  // Reset counter juga
        g_reset_zigzag_left = false;
      }
          
      // Increment counter
      iteration_counter++;
      
      // Hanya update step jika counter mencapai interval
      if (iteration_counter >= rudder_step_interval) {
        if (current_step > -10.0f) {  // Increment selama belum mencapai target 10
          current_step -= 1.0f;
          if (current_step <= -10.0f) {
            current_step = -10.0f;
          }
        }
        iteration_counter = 0;  // Reset counter
      }
      
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      // Set offset dengan step saat ini
      servo_angle_current_offset = current_step;
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
    
      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
        
      // HANYA TRANSISI KE STATE BERIKUTNYA JIKA SUDAH MENCAPAI TARGET
      if (current_step <= -10.0f) {
        state = belok_kiri_1b;
      }

    break;

    /*************************************************/
    
    case belok_kiri_1b:
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
    
      if (dataToSend.zigzag_yaw >= 1000) //menunggu heading zigzag lebih dari 10 derajat (× 100 = 1000)
      {
      state = belok_kanan_2a;
      g_reset_zigzag_left = true;
      } 
    break;

     /*************************************************/

    case belok_kanan_2a: //rudder belok kanan 10 derajat
    // Serial.println("DEBUG_Zigzag: belok_kanan_2a");
    // static float current_step = 0.0f;
    // static uint8_t iteration_counter = 0;
    
      // Check if reset was requested
      if (g_reset_zigzag_right) {
        // current_step = 0.0f;
        iteration_counter = 0;  // Reset counter juga
        g_reset_zigzag_right = false;
      }



      // Increment counter
      iteration_counter++;

      // Hanya update step jika counter mencapai interval
      if (iteration_counter >= rudder_step_interval) {
        if (current_step < 10.0f) {
          current_step += 1.0f;
          if (current_step >= 10.0f) {
            current_step = 10.0f;
          }
        }
        iteration_counter = 0;  // Reset counter
      }

      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      // Set offset dengan step saat ini
      servo_angle_current_offset = current_step;
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
      
      // HANYA TRANSISI KE STATE BERIKUTNYA JIKA SUDAH MENCAPAI TARGET
      if (current_step >= 10.0f) {
        state = belok_kanan_2b;
      }
    break;

    /*************************************************/
    
    case belok_kanan_2b:
    // Serial.println("DEBUG_Zigzag: belok_kanan_2b");
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
    
      if (dataToSend.zigzag_yaw <= -1000) //menunggu heading zigzag lebih dari 10 derajat (× 100 = -1000)
      {
      state = belok_kiri_2a;
      g_reset_zigzag_right = true;
      }   
    break;

     /*************************************************/

    
    case belok_kiri_2a: //rudder belok kiri 10 derajat
      // Serial.println("DEBUG_Zigzag: belok_kiri_2a");
      // static float current_step = 0.0f;
      // static uint8_t iteration_counter = 0;
      
      // Check if reset was requested
      if (g_reset_zigzag_left) {
        //current_step = 0.0f;
        iteration_counter = 0;  // Reset counter juga
        g_reset_zigzag_left = false;
      }
      

      
      // Increment counter
      iteration_counter++;
      
      // Hanya update step jika counter mencapai interval
      if (iteration_counter >= rudder_step_interval) {
        if (current_step > -10.0f) {
          current_step -= 1.0f;
          if (current_step <= -10.0f) {
            current_step = -10.0f;
          }
        }
        iteration_counter = 0;  // Reset counter
      }
      
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      // Set offset dengan step saat ini
      servo_angle_current_offset = current_step;
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
    
      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
        
      // HANYA TRANSISI KE STATE BERIKUTNYA JIKA SUDAH MENCAPAI TARGET
      if (current_step <= -10.0f) {
        state = belok_kiri_2b;
      } 
    
    break;

    /*************************************************/

    case belok_kiri_2b:
      // Serial.println("DEBUG_Zigzag: belok_kiri_2b");
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
    
      if (dataToSend.zigzag_yaw >= 1000) //menunggu heading zigzag lebih dari 10 derajat (× 100 = 1000)
      {
      state = belok_kanan_3a;
      g_reset_zigzag_left = true;
      }  
    break;

     /*************************************************/
     
    case belok_kanan_3a:
    // Serial.println("DEBUG_Zigzag: belok_kanan_3a");
    // static float current_step = 0.0f;
    // static uint8_t iteration_counter = 0;
    
      // Check if reset was requested
      if (g_reset_zigzag_right) {
        //current_step = 0.0f;
        iteration_counter = 0;  // Reset counter juga
        g_reset_zigzag_right = false;
      }


      // Increment counter
      iteration_counter++;

