InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Misc/ESP_Now_Send_Ver2025_revJan2026/src/main.cpp
      // Hanya update step jika counter mencapai interval
      if (iteration_counter >= rudder_step_interval) {
        if (current_step < 10.0f) {
          current_step += 1.0f;
          if (current_step >= 10.0f) {
            current_step = 10.0f;
          }
        }
        iteration_counter = 0;  // Reset counter
      }

      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      // Set offset dengan step saat ini
      servo_angle_current_offset = current_step;
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
      
      // HANYA TRANSISI KE STATE BERIKUTNYA JIKA SUDAH MENCAPAI TARGET
      if (current_step >= 10.0f) {
        state = belok_kanan_3b;
      }
    
    break;

   /*************************************************/
   
    case belok_kanan_3b:
    // Serial.println("DEBUG_Zigzag: belok_kanan_3b");
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
    
      if (dataToSend.zigzag_yaw <= -1000) //menunggu heading zigzag lebih dari 10 derajat (× 100 = -1000)
      {
      state = lurus_akhir;
      g_reset_zigzag_right = true;
      }
    break;

     /*************************************************/

    case lurus_akhir:
     g_reset_zigzag_right = true;
     g_reset_zigzag_left = true;

     calculated_angle = REFERENCE_ANGLE;

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
    break;
     
  }
}

void rudder_zigzag_20() {
 
  // Hitung zigzag_yaw: yaw_current - zigzag_setpoint (dalam derajat float)
  float yaw_float = dataToSend.yaw / 100.0;  // Konversi uint16_t ke float
  float zigzag_yaw_float = yaw_float - zigzag_setpoint;
  dataToSend.zigzag_yaw = (int16_t)(zigzag_yaw_float * 100);  // Konversi ke int16_t (× 100)
  // Serial.print(dataToSend.zigzag_yaw); Serial.print(",");
  // Serial.print(zigzag_setpoint); Serial.print(",");
  float calculated_angle;
  bool write_result;
  static float current_step = 0.0f;
  static uint8_t iteration_counter = 0;  // Counter untuk menghitung iterasi
  Serial.print(current_step); 
  Serial.print(",");
  Serial.print(state);
  Serial.print(",");

  switch (state)
  {
    
    case belok_kanan_1a: //rudder belok kanan 20 derajat
      if (g_reset_zigzag_right) {
        current_step = 0.0f;
        iteration_counter = 0;  // Reset counter juga
        g_reset_zigzag_right = false;
      }
      
     
      // Increment counter
      iteration_counter++;
      Serial.print(iteration_counter);
      Serial.print(",");
      
      // Hanya update step jika counter mencapai interval
      if (iteration_counter >= rudder_step_interval) {
        if (current_step < 20.0f) {
          current_step += 2.0f;
          if (current_step >= 20.0f) {
            current_step = 20.0f;
          }
        }
        iteration_counter = 0;  // Reset counter
      }
      
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      // Set offset dengan step saat ini
      servo_angle_current_offset = current_step;
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
      // Serial.print(calculated_angle); Serial.print(",");
    
      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
      // Serial.println(servo_duty); 
      //Serial.print(",");  
      
      // HANYA TRANSISI KE STATE BERIKUTNYA JIKA SUDAH MENCAPAI TARGET
      if (current_step >= 20.0f) {
        state = belok_kanan_1b;
      }
    
    break;

    /*************************************************/
    
    case belok_kanan_1b:
      // Serial.println("DEBUG_Zigzag: belok_kanan_1b");
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
      // Serial.print(calculated_angle);
      // Serial.print(",");

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
      // Serial.println(servo_duty);
      
      if (dataToSend.zigzag_yaw <= -2000) //menunggu heading zigzag lebih dari 20 derajat (× 100 = -2000)
      {
      state = belok_kiri_1a;
      g_reset_zigzag_right = true;
      } 
     break;

    /*************************************************/
    
    case belok_kiri_1a: //rudder belok kiri 20 derajat
    // Serial.print("belok_kiri_1a"); Serial.print(",");

      if (g_reset_zigzag_left) {
        // current_step = 0.0f;
        iteration_counter = 0;  // Reset counter juga
        g_reset_zigzag_left = false;
      }
          
      // Increment counter
      iteration_counter++;
      
      // Hanya update step jika counter mencapai interval
      if (iteration_counter >= rudder_step_interval) {
        if (current_step > -20.0f) {  // Increment selama belum mencapai target 20
          current_step -= 2.0f;
          if (current_step <= -20.0f) {
            current_step = -20.0f;
          }
        }
        iteration_counter = 0;  // Reset counter
      }
      
      // SELALU LAKUKAN KALKULASI DAN PENGATURAN SERVO
      // Set offset dengan step saat ini
      servo_angle_current_offset = current_step;
      calculated_angle = REFERENCE_ANGLE + servo_angle_current_offset;
    
      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
        
      // HANYA TRANSISI KE STATE BERIKUTNYA JIKA SUDAH MENCAPAI TARGET
      if (current_step <= -20.0f) {
        state = belok_kiri_1b;
      }

    break;

    /*************************************************/
    
