InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Misc/ESP_Now_Send_Ver2025_revJan2026/src/main.cpp
      if (dataToSend.zigzag_yaw <= -2000) //menunggu heading zigzag lebih dari 20 derajat (× 100 = -2000)
      {
      state = lurus_akhir;
      g_reset_zigzag_right = true;
      }
    break;

     /*************************************************/

    case lurus_akhir:
     g_reset_zigzag_right = true;
     g_reset_zigzag_left = true;

     calculated_angle = REFERENCE_ANGLE;

      // Set duty cycle to be write for servo rudder degree move
      servo_duty = angleToDuty(calculated_angle);
      write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
    break;
     
  }
}

/**
 * @brief Mode Neutral - Set servo rudder ke posisi neutral (90°)
 * 
 * @details
 * Function ini digunakan ketika input RC berada di dead zone atau konflik.
 * Servo rudder akan di-set ke posisi neutral (90°).
 * 
 * @note
 * Digunakan untuk handle kasus:
 * - modeturning di dead zone (1250-1750) && modezigzag di dead zone (1250-1750)
 * - modeturning >= 1750 && modezigzag >= 1750 (konflik)
 * - modeturning >= 1750 && modezigzag <= 1250 (konflik)
 * - modeturning <= 1250 && modezigzag >= 1750 (konflik)
 * - modeturning <= 1250 && modezigzag <= 1250 (konflik)
 */
void rudder_neutral() {
  // Reset semua flag turning/zigzag
  g_reset_turning_left = true;
  g_reset_turning_right = true;
  g_reset_zigzag_left = true;
  g_reset_zigzag_right = true;
  state = belok_kanan_1a;  // Reset state ke awal
  
  // Set servo ke posisi neutral (90°)
  servo_angle_current_offset = 0.0f;
  float calculated_angle = REFERENCE_ANGLE;  // 90.0°
  servo_duty = angleToDuty(calculated_angle);
  bool write_result = ledcWrite(SERVO_RUDDER_pin, servo_duty);
  
  // Update zigzag setpoint dari yaw saat ini
  zigzag_setpoint = dataToSend.yaw / 100.0;
  dataToSend.zigzag_yaw = (int16_t)(((dataToSend.yaw / 100.0) - zigzag_setpoint) * 100);
}

/**
 * @brief Check dan eksekusi mode kontrol berdasarkan input RC
 * 
 * @param modeautomanual Channel 6: Mode auto/manual (≥1750: Auto, <1750: Manual)
 * @param modezigzag Channel 2: Mode zigzag (≤1250: Zigzag 10°, ≥1750: Zigzag 20°)
 * @param modeturning Channel 1: Mode turning (≥1750: Left, ≤1250: Right)
 * 
 * @details
 * Function ini menentukan mode kontrol berdasarkan kombinasi input dari receiver RC:
 * 
 * Mode Manual (modeautomanual < 1750):
 *   - Kontrol rudder langsung dari channel 1
 *   - mode_auto = 0
 * 
 * Mode Auto (modeautomanual >= 1750):
 *   - Turning Left (modeturning >= 1750 && modezigzag di dead zone): mode_auto = 1
 *   - Turning Right (modeturning <= 1250 && modezigzag di dead zone): mode_auto = 2
 *   - Zigzag 10° (modeturning di dead zone && modezigzag <= 1250): mode_auto = 3
 *   - Zigzag 20° (modeturning di dead zone && modezigzag >= 1750): mode_auto = 4
 *   - Neutral (konflik atau dead zone): mode_auto = 5
 * 
 * @note
 * Jika modeturning dan modezigzag keduanya aktif (konflik), maka masuk ke neutral
 * Dead zone: 1250-1750 (range antara aktif)
 */
void check_mode_auto_manual(uint16_t modeautomanual, uint16_t modezigzag, uint16_t modeturning) {
  if (modeautomanual >= 1750) {
    // ========== Mode Auto ==========
    
    // Check apakah modeturning aktif (>= 1750)
    if (modeturning >= 1750) {
      // Check apakah modezigzag juga aktif (konflik)
      if (modezigzag <= 1250 || modezigzag >= 1750) {
        // Konflik: modeturning aktif DAN modezigzag aktif → Neutral
        rudder_neutral();
        // Serial.println("Mode Neutral (Konflik: Turning Left + Zigzag)");
        dataToSend.mode_auto = 5;
      }
      else {
        // modeturning >= 1750 && modezigzag di dead zone (1250-1750) → Turning Left
        rudder_turning_right();
        // Serial.println("Mode Turning Left");
        dataToSend.mode_auto = 1;
      }
    } 
    // Check apakah modeturning aktif (<= 1250)
    else if (modeturning <= 1250) {
      // Check apakah modezigzag juga aktif (konflik)
      if (modezigzag <= 1250 || modezigzag >= 1750) {
        // Konflik: modeturning aktif DAN modezigzag aktif → Neutral
        rudder_neutral();
        // Serial.println("Mode Neutral (Konflik: Turning Right + Zigzag)");
        dataToSend.mode_auto = 5;
      }
      else {
        // modeturning <= 1250 && modezigzag di dead zone (1250-1750) → Turning Right
        rudder_turning_left();
        // Serial.println("Mode Turning Right");
        dataToSend.mode_auto = 2;
      }
    }
    // modeturning di dead zone (1250-1750)
    else {
      // Cek modezigzag
      if (modezigzag <= 1250) {
        // Mode: Zigzag 10°
        rudder_zigzag_10();
        // Serial.println("Mode Zigzag 10");
        dataToSend.mode_auto = 3;
      } 
      else if (modezigzag >= 1750) {
        // Mode: Zigzag 20°
        rudder_zigzag_20();
        // Serial.println("Mode Zigzag 20");
        dataToSend.mode_auto = 4;
      }
      else {
        // modeturning di dead zone (1250-1750) && modezigzag di dead zone (1250-1750)
        // Set servo ke neutral
        rudder_neutral();
        // Serial.println("Mode Neutral (Dead Zone)");
        dataToSend.mode_auto = 5;
      }
    }
  }
  else {
    // ========== Mode Manual ==========
    rudder_manual();
    //  Serial.println("Mode Auto Manual");
    dataToSend.mode_auto = 0;
  }
}

/**
 * @brief Setup function - Inisialisasi semua hardware dan komunikasi
 * 
 * @details
 * Function ini melakukan inisialisasi:
 * 1. Serial Monitor (115200 baud)
 * 2. PPM interrupt handler untuk receiver RC
 * 3. Pulse counter interrupt untuk rotary encoder
 * 4. ADC configuration untuk feedback dan battery monitoring
 * 5. Servo PWM configuration (rudder, propeller speed/direction)
 * 6. GNSS module (u-blox GPS) via Serial1
 * 7. IMU (HWT905TTL) via Serial2
 * 8. ESP-NOW untuk wireless communication
 * 
 * @note
 * - Semua interrupt handler harus dideklarasikan dengan IRAM_ATTR
 * - ADC2 tidak dapat digunakan saat WiFi aktif (gunakan ADC1 saja)
 * - GNSS akan dikonfigurasi ke 115200 baud dan 10 Hz update rate
 */
void setup() {
    // ========== Serial Monitor Initialization ==========
    Serial.begin(115200);
    delay(500);
    
    // ========== PPM Interrupt Setup ==========
    pinMode(PPM_PIN, INPUT);
    attachInterrupt(digitalPinToInterrupt(PPM_PIN), ppm_interrupt_handler, CHANGE);
    
    // Setup Pulse Counter for Motor Prop 1
    pinMode(PULSE_PIN_Motor_prop_1, INPUT);
    attachInterrupt(digitalPinToInterrupt(PULSE_PIN_Motor_prop_1), pulse_interrupt_handler_motor_prop_1, RISING);
    
    // Setup Pulse Counter for Motor Prop 2
    pinMode(PULSE_PIN_Motor_prop_2, INPUT);
    attachInterrupt(digitalPinToInterrupt(PULSE_PIN_Motor_prop_2), pulse_interrupt_handler_motor_prop_2, RISING);
    
    // Configure ADC settings
    analogReadResolution(12);     
    
    dataToSend.zigzag_yaw = 0;

    bool attach_PWM_pin = ledcAttachChannel(SERVO_RUDDER_pin, SERVO_RUDDER_freq, SERVO_RUDDER_resolution, 0);
    if (attach_PWM_pin) {
      Serial.println("Servo Rudder attached to pin 5");
    } else {
      Serial.println("Failed to attach servo rudder");
    }

    // Setup LEDC untuk Propeller Speed
    bool attach_prop_speed = ledcAttachChannel(PROP_SPEED_pin, PROP_SPEED_freq, PROP_SPEED_resolution, 2);
    if (attach_prop_speed) {
      Serial.println("Propeller Speed attached to pin 6 (LEDC)");
    } else {
      Serial.println("Failed to attach propeller speed");
    }

    // Setup LEDC untuk Propeller Direction
    bool attach_prop_dir = ledcAttachChannel(PROP_DIRECTION_pin, PROP_DIRECTION_freq, PROP_DIRECTION_resolution, 1);
    if (attach_prop_dir) {
      Serial.println("Propeller Direction attached to pin 7 (LEDC)");
    } else {
      Serial.println("Failed to attach propeller direction");
    }
    // Note: servoPropSpeed dan servoPropDirection tidak digunakan lagi, sudah diganti dengan LEDC

    delay(1000);
    Serial.println("PPM Reader initialized - Reading FS-iA6B on pin 4");

      // Start Serial 2 with the defined RX and TX pins and a baud rate of 9600
    gpsSerial.begin(GPS_BAUD, SERIAL_8N1, RXD1, TXD1);
    Serial.println("Serial 2 started at 9600 baud rate");

    // 1) Set u-blox UART1 baud to 115200 at current link speed (9600)
    delay(200);
    setUbxUartBaud(115200);
    delay(200);
    // 2) Switch ESP32 UART to 115200 to match the module
  #if ARDUINO_USB_CDC_ON_BOOT
    // ensure buffered data is flushed before changing baud
  #endif
    gpsSerial.flush();
    // Prefer updateBaudRate if available; fallback to end/begin
  #if defined(HW_SERIAL_HAS_UPDATEBAUDRATE)
    gpsSerial.updateBaudRate(115200);
  #else
    gpsSerial.end();
    delay(50);
    gpsSerial.begin(115200, SERIAL_8N1, RXD1, TXD1);
  #endif
    Serial.println("GPS UART switched to 115200");

    // 3) Now set 10 Hz update rate at the new baud
    delay(200);
    setUbxMeasurementRate(100); // 100 ms = 10 Hz

    // 4) Persist configuration to BBR and Flash (if supported)
    delay(200);
    saveUbxConfig(true, true);

    // setting for hwt905ttl serial port
    HWT905TTL_Serial.begin(HWT905TTL_BAUD, SERIAL_8N1, RXD2, TXD2);

        // Set device as a Wi-Fi Station
    WiFi.mode(WIFI_STA);

    // Init ESP-NOW
    if (esp_now_init() != ESP_OK) {
      Serial.println("Error initializing ESP-NOW");
      return;
    }

    // Once ESPNow is successfully Init, we will register for Send CB to
    // get the status of Trasnmitted packet
    // esp_now_register_send_cb(OnDataSent);
    
    // Register peer
    memcpy(peerInfo.peer_addr, broadcastAddress, 6);
    peerInfo.channel = 0;  
    peerInfo.encrypt = false;
    
    // Add peer        
    if (esp_now_add_peer(&peerInfo) != ESP_OK){
      Serial.println("Failed to add peer");
      return;
    }
}

/**
 * @brief Loop function - Main program loop
 * 
 * @details
 * Function ini berjalan terus menerus dan melakukan:
 * 1. Membaca data dari GNSS module (Serial1)
 * 2. Membaca data dari IMU (Serial2)
 * 3. Setiap 100ms (10 Hz):
 *    - Update data GPS (latitude, longitude, speed)
 *    - Update data IMU (roll, pitch, yaw)
 *    - Map PPM values ke range 1000-2000
 *    - Check mode auto/manual dan eksekusi fungsi kontrol
 *    - Baca feedback servo dari ADC
 *    - Kontrol motor propeller (speed dan direction)
 *    - Hitung RPM dari rotary encoder
 *    - Baca tegangan baterai
 *    - Kirim data via ESP-NOW
 * 
 * @note
 * - Update rate: 10 Hz (setiap 100ms)
 * - Semua data dikirim dalam format fixed-point (× 100)
 * - Struktur data harus sama dengan receiver
 */
void loop() {
    unsigned long currentMillis = millis();
    
    // ========== Read GNSS Data ==========
    // Parse data GPS dari Serial1 (non-blocking)
    while (gpsSerial.available() > 0) {
      gps.encode(gpsSerial.read());
    }

    // ========== Read IMU Data ==========
    // Parse data IMU dari Serial2 (non-blocking)
    while (HWT905TTL_Serial.available()) 
    {
      JY901.CopeSerialData(HWT905TTL_Serial.read()); // Call JY901 data cope function
    }

    // ========== Main Loop - Run setiap 100ms (10 Hz) ==========
    if (currentMillis - previousMillis >= intervaltime) {
        // Serial.print(currentMillis);
        // Serial.print(" ");
        previousMillis = currentMillis;
        dataToSend.timestamp = (double)currentMillis / 1000.0;

        // Snapshot to struct every interval, regardless of isUpdated()
        latestGpsData.latitude = gps.location.lat();
        latestGpsData.longitude = gps.location.lng();
        latestGpsData.speedMps = gps.speed.mps();

        // latestGpsData.locationValid = gps.location.isValid();
        // latestGpsData.timeValid = gps.time.isValid();
        // latestGpsData.locationAgeMs = gps.location.age();
        // latestGpsData.timeAgeMs = gps.time.age();
        // latestGpsData.altitudeM = gps.altitude.meters();
        // latestGpsData.hdop = gps.hdop.value() / 100.0;
        // latestGpsData.satellites = gps.satellites.value();
        // if (latestGpsData.locationValid) {
        // }
        dataToSend.latitude = latestGpsData.latitude;
        dataToSend.longitude = latestGpsData.longitude;
        // Konversi speedMps ke uint16_t (× 100)
        dataToSend.speedMps = (uint16_t)(latestGpsData.speedMps * 100);

        // Hitung roll, pitch, yaw sebagai float dulu
        float roll = (float)JY901.stcAngle.Angle[0]/32768*180;
        float pitch = (float)JY901.stcAngle.Angle[1]/32768*180;
        float rawYaw = (float)JY901.stcAngle.Angle[2]/32768*180;
        
        // Modifikasi: jika yaw < 0, jadikan 360 + yaw
        float yaw;
        if (rawYaw < 0) {
          yaw = 360.0 + rawYaw;
        } else {
          yaw = rawYaw;
        }
        
        // Konversi ke int16_t/uint16_t (× 100)
        dataToSend.roll = (int16_t)(roll * 100);
        dataToSend.pitch = (int16_t)(pitch * 100);
        dataToSend.yaw = (uint16_t)(yaw * 100);
        
        for (uint8_t i = 0; i < CHANNEL_COUNT; i++) {
            // Convert raw PPM FS-iA6B values (600-1600) to standard servo range (1000-2000)
            ppm_mapped[i] = map(ppm_values[i], PPM_MIN_CHANNEL_VALUE, PPM_MAX_CHANNEL_VALUE, 1000, 2000);
        }
        
