InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Misc/ESP_Now_Send_Ver2025_revJan2026/src/main.cpp
        /*
        controlInput.rudder = ppm_mapped[0]; CH1 tuas kanan bergerak kanan kiri
        controlInput.mode_zigzag = ppm_mapped[1]; // CH2 tuas kanan bergerak atas bawah
        controlInput.propSpeed = ppm_mapped[2];   // CH3 CH2 tuas kiri bergerak atas bawah
        controlInput.propDirection = ppm_mapped[4]; // CH5 Switch A bergerak atas bawah
        controlInput.mode_auto_manual = ppm_mapped[5]; CH6 Switch B bergerak atas bawah
        
        */
        controlInput.mode_auto_manual = ppm_mapped[5];  // CH6
        controlInput.mode_zigzag = ppm_mapped[1];        // CH2
        controlInput.rudder = ppm_mapped[0];              // CH1
        
        check_mode_auto_manual (controlInput.mode_auto_manual, controlInput.mode_zigzag, controlInput.rudder);

        
        // Read analog values of servo potensiometer output in millivolts
        uint32_t adc_millivolts_servo_1 = analogReadMilliVolts(ADC_PIN_SERVO_1);
        uint32_t adc_millivolts_servo_2 = analogReadMilliVolts(ADC_PIN_SERVO_2);
  
        float Calc_deg_servo_1 = adc_millivolts_servo_1 * 0.0595 - 98.848;
        float Calc_deg_servo_2 = adc_millivolts_servo_2 * 0.0594 - 98.801;

        // Set PWM for PropSpeed dan PropDirection
        controlInput.propSpeed = ppm_mapped[2];           // CH3
        controlInput.propDirection = ppm_mapped[4];       // CH5
        
        // Generate PWM for PropSpeed (menggunakan LEDC)
        // Konversi microseconds ke duty cycle menggunakan fungsi yang sama
        uint32_t prop_speed_duty = microsecondsToDuty(controlInput.propSpeed);
        // Generate PWM menggunakan LEDC
        bool write_result_prop_speed = ledcWrite(PROP_SPEED_pin, prop_speed_duty);
        
        // Generate PWM for PropDirection (menggunakan LEDC)
        // Konversi microseconds ke duty cycle menggunakan fungsi yang sama
        uint32_t prop_dir_duty = microsecondsToDuty(controlInput.propDirection);
        // Generate PWM menggunakan LEDC
        bool write_result_prop_dir = ledcWrite(PROP_DIRECTION_pin, prop_dir_duty); 

        // Buat payload ringkas untuk pengiriman/logging
        // Konversi servo angle ke int16_t (× 100)
        dataToSend.Calc_deg_servo_1 = (int16_t)(Calc_deg_servo_1 * 100);
        dataToSend.Calc_deg_servo_2 = (int16_t)(Calc_deg_servo_2 * 100);
        (void)dataToSend; // hindari peringatan variabel tidak terpakai jika belum digunakan

        // ========== Calculate RPM for Motor Prop 1 ==========
        // Calculate pulses per loop (100ms) using delta method
        static uint32_t previous_pulse_counter_motor_prop_1 = 0;
        uint32_t pulses_per_loop_motor_prop_1 = pulse_counter_motor_prop_1 - previous_pulse_counter_motor_prop_1;
        previous_pulse_counter_motor_prop_1 = pulse_counter_motor_prop_1;
        
        // Add to moving average buffer (circular buffer)
        pulse_buffer_motor_prop_1[buffer_index_motor_prop_1] = pulses_per_loop_motor_prop_1;
        buffer_index_motor_prop_1 = (buffer_index_motor_prop_1 + 1) % RPM_SAMPLES_motor_prop_1;  // Circular index
        
        // Calculate moving average
        uint32_t pulse_sum_motor_prop_1 = 0;
        for (uint8_t i = 0; i < RPM_SAMPLES_motor_prop_1; i++) {
            pulse_sum_motor_prop_1 += pulse_buffer_motor_prop_1[i];
        }
        float avg_pulses_per_loop_motor_prop_1 = pulse_sum_motor_prop_1 / (float)RPM_SAMPLES_motor_prop_1;
        
        // Calculate RPM and cast directly to uint16_t (PPR = 1, loop interval = 100ms = 0.1s)
        // RPM = (avg_pulses_per_loop / 0.1s) * 60 = avg_pulses_per_loop * 600
        dataToSend.rpm_prop_1 = (uint16_t)(avg_pulses_per_loop_motor_prop_1 * 600.0);  //rpm motor propeller 1
        
        // ========== Calculate RPM for Motor Prop 2 ==========
        // Calculate pulses per loop (100ms) using delta method
        static uint32_t previous_pulse_counter_motor_prop_2 = 0;
        uint32_t pulses_per_loop_motor_prop_2 = pulse_counter_motor_prop_2 - previous_pulse_counter_motor_prop_2;
        previous_pulse_counter_motor_prop_2 = pulse_counter_motor_prop_2;
        
        // Add to moving average buffer (circular buffer)
        pulse_buffer_motor_prop_2[buffer_index_motor_prop_2] = pulses_per_loop_motor_prop_2;
        buffer_index_motor_prop_2 = (buffer_index_motor_prop_2 + 1) % RPM_SAMPLES_motor_prop_2;  // Circular index
        
        // Calculate moving average
        uint32_t pulse_sum_motor_prop_2 = 0;
        for (uint8_t i = 0; i < RPM_SAMPLES_motor_prop_2; i++) {
            pulse_sum_motor_prop_2 += pulse_buffer_motor_prop_2[i];
        }
        float avg_pulses_per_loop_motor_prop_2 = pulse_sum_motor_prop_2 / (float)RPM_SAMPLES_motor_prop_2;
        
        // Calculate RPM and cast directly to uint16_t (PPR = 1, loop interval = 100ms = 0.1s)
        // RPM = (avg_pulses_per_loop / 0.1s) * 60 = avg_pulses_per_loop * 600
        dataToSend.rpm_prop_2 = (uint16_t)(avg_pulses_per_loop_motor_prop_2 * 600.0);  //rpm motor propeller 2
        
        // Print RPM motor prop 1 and 2
        // Serial.print("RPM_prop_1: ");
        // Serial.print(dataToSend.rpm_prop_1);
        // Serial.print(" | RPM_prop_2: ");
        // Serial.print(dataToSend.rpm_prop_2);
        // Serial.print(" | Total_pulses_1: ");
        // Serial.print(pulse_counter_motor_prop_1);
        // Serial.print(" | Total_pulses_2: ");
        // Serial.println(pulse_counter_motor_prop_2); 

        // Baca ADC dalam miliVolt dari GPIO1 (ADC1_CH0)
        uint32_t adc_millivolts_batt_1 = analogReadMilliVolts(ADC_PIN_BATT_1);
        // Konversi mV ke V, lalu kalikan dengan faktor skala 5 (voltage divider)
        float volt_batt_1 = (adc_millivolts_batt_1 / 1000.0) * 5.0;
        // Konversi ke uint16_t (× 100) untuk pengiriman
        dataToSend.battery_1 = (uint16_t)(volt_batt_1 * 100); // batere for ESP32-S3, Servo, HWT905TTL, Receiver RC, GNSS, Rotary Encoder
        
        // Baca ADC dalam miliVolt dari GPIO2 (ADC1_CH1)
        uint32_t adc_millivolts_batt_2 = analogReadMilliVolts(ADC_PIN_BATT_2);
        // Konversi mV ke V, lalu kalikan dengan faktor skala 5 (voltage divider)
        float volt_batt_2 = (adc_millivolts_batt_2 / 1000.0) * 5.0;
        // Konversi ke uint16_t (× 100) untuk pengiriman
        dataToSend.battery_2 = (uint16_t)(volt_batt_2 * 100); // batere for motor propeller

