InskalBTHBPPT/Ship_Model_Control_ESP32-S3-v2026.01/PlatformIO/Misc/ESP_Now_Send_Ver2025_revJan2026/src/main.cpp
        // ========== Serial Print Debugging (SETELAH semua proses kontrol selesai) ==========
        // Print dilakukan SETELAH check_mode_auto_manual() selesai (yang sudah mengupdate zigzag_setpoint dan zigzag_yaw)
        // dan SEBELUM mengirim data via ESP-NOW, sehingga nilai yang di-print adalah nilai final yang akan dikirim
        //Print CSV: timestamp,lat,lon,speed,deg1,deg2
        // Konversi fixed-point kembali ke float untuk display (÷ 100)
        // 
        Serial.print(dataToSend.timestamp, 3); Serial.println("");
        // Serial.print(dataToSend.latitude, 6); Serial.println(""); //Serial.print(",");
        // Serial.print(dataToSend.longitude, 6); Serial.print(",");
        // Serial.print(dataToSend.speedMps / 100.0, 2); Serial.print(",");
        Serial.print(dataToSend.Calc_deg_servo_1 / 100.0, 2); Serial.print(",");
        Serial.print(dataToSend.Calc_deg_servo_2 / 100.0, 2); Serial.print(",");
        // Serial.print(dataToSend.roll / 100.0, 2); Serial.print(",");
        // Serial.print(dataToSend.pitch / 100. 0, 2); Serial.print(",");
        Serial.print(dataToSend.yaw / 100.0, 2); Serial.print(",");
        Serial.print(zigzag_setpoint, 2); Serial.print(",");
        Serial.print(dataToSend.zigzag_yaw / 100.0, 2); Serial.print(","); //Serial.println(""); 
        // Serial.print(dataToSend.rpm_prop_1 / 100.0, 2); Serial.print(",");
        // Serial.print(dataToSend.rpm_prop_2 / 100.0, 2); Serial.print(",");
        // Serial.print(dataToSend.battery_1 / 100.0, 2); Serial.print(",");
        // Serial.println(dataToSend.battery_2 / 100.0, 2);
        Serial.println(dataToSend.mode_auto);

        // ========== Send message via ESP-NOW ==========
        esp_err_t result = esp_now_send(broadcastAddress, (uint8_t *) &dataToSend, sizeof(dataToSend));
        
        if (result == ESP_OK) {
          //Serial.println("Sent with success");
        }
        else {
          //Serial.println("Error sending the data");
        }

        // Serial.println(millis()/1000.000,3);
    } // end of if interval
}
